In [6]:
%pylab inline
import pandas as pd
from pandas import Series, DataFrame

Populating the interactive namespace from numpy and matplotlib

In [1]:
# (1) Dates and times in general
# (2) Dates and times in Pandas -- loading data
# (3) Intervals / timedeltas -- creating and calculating
# (4) Resampling and aggregate measures

In [2]:
# http://files.lerner.co.il/data-science-exercise-files.zip

# Two types of data structures for dates and times

- timestamp, datetime object: reflects a specific point in time
    - your birthday
    - your anniversary
    - when a meeting is going to happen
- timedelta: reflects a span of time â€” measured in years/months/etc., but no fixed point
    - how long is a meeting going to last?
    - how many seconds have you been alive?
    - how much longer must I sit through this class

In [3]:
!ls -l taxi.csv

-rw-r--r-- 1 reuven staff 1566751 Feb 16  2016 taxi.csv

In [4]:
!head taxi.csv

In [8]:
df = pd.read_csv('taxi.csv',
                usecols=['tpep_pickup_datetime',
                        'tpep_dropoff_datetime',
                        'passenger_count',
                        'trip_distance',
                        'total_amount'])

df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [9]:
df.shape

(9999, 5)

In [10]:
df.dtypes

tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
total_amount             float64
dtype: object

In [11]:
df = pd.read_csv('taxi.csv',
                usecols=['tpep_pickup_datetime',
                        'tpep_dropoff_datetime',
                        'passenger_count',
                        'trip_distance',
                        'total_amount'],
                parse_dates=['tpep_pickup_datetime',
                            'tpep_dropoff_datetime'])

df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [12]:
df.dtypes

tpep_pickup_datetime     datetime64[ns]
tpep_dropoff_datetime    datetime64[ns]
passenger_count                   int64
trip_distance                   float64
total_amount                    float64
dtype: object

In [13]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: str = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.
    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

# Exercise: Load taxi data

1. Load the data from `taxi.csv` into a data frame
2. Make sure (using `df.dtypes`) that the pickup and dropoff columns are indeed `datetime64` objects.

In [14]:
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [20]:
df['tpep_pickup_datetime'].dt.year

0       2015
1       2015
2       2015
3       2015
4       2015
        ...
9994    2015
9995    2015
9996    2015
9997    2015
9998    2015
Name: tpep_pickup_datetime, Length: 9999, dtype: int64

# Exercise: Most popular travel hours

1. Using our datetime information, which hour was the most popular for taking taxis in New York from our sample data? 
2. What were all of the different hours for which we have data?  Can we then trust the assertion made in question 1?

In [23]:
df['tpep_pickup_datetime'].dt.hour.value_counts()

11    4396
15    2536
0     2439
16     628
Name: tpep_pickup_datetime, dtype: int64

In [24]:
# timestamp + delta = timestamp
# timestamp - timestamp = delta

In [25]:
df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']

0      0 days 00:28:23
1      0 days 00:08:26
2      0 days 00:10:59
3      0 days 00:19:31
4      0 days 00:13:17
             ...
9994   0 days 00:11:19
9995   0 days 00:15:17
9996   0 days 00:24:25
9997   0 days 00:06:08
9998   0 days 00:23:29
Length: 9999, dtype: timedelta64[ns]

In [26]:
df['trip_time'] = df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']

In [27]:
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,0 days 00:28:23
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17

In [30]:
df[df['trip_time'] < '00:10:00'].shape

(3758, 6)

# Exercise: Trip times

1. How many trips took longer than 1 hour?
2. Of the trips that took longer than 1 hour, how much did they cost, on average?
3. What was the average number of passengers in trips take < 10 minutes?

In [36]:
df[df['trip_time'] > '1 hour']

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
7,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84,0 days 01:17:11
88,2015-06-02 11:20:37,2015-06-02 12:35:21,2,23.76,94.00,0 days 01:14:44
126,2015-06-02 11:21:03,2015-06-03 00:00:00,3,1.06,11.16,0 days 12:38:57
174,2015-06-02 11:21:42,2015-06-02 12:22:51,1,6.65,45.96,0 days 01:01:09
246,2015-06-02 11:19:46,2015-06-02 12:26:33,1,0.00,3.30,0 days 01:06:47
...,...,...,...,...,...,...
7907,2015-06-04 15:23:01,2015-06-04 16:30:03,1,26.60,96.84,0 days 01:07:02
8042,2015-06-06 16:53:20,2015-06-06 17:54:20,1,17.98,58.34,0 days 01:01:00
8171,2015-06-06 16:53:33,2015-06-06 18:01:48,1,18.01,58.34,0 days 01:08:15
8201,2015-06-06 16:53:56,2015-06-06 17:54:22,1,17.36,69.00,0 days 01:00:26
8513,2015-06-01 00:04:50,2015-06-01 01:31:44,1,60.30,160.05,0 days 01:26:54

In [40]:
df.query('trip_time > "1 hour"')['total_amount']

7        73.84
88       94.00
126      11.16
174      45.96
246       3.30
         ...
7907     96.84
8042     58.34
8171     58.34
8201     69.00
8513    160.05
Name: total_amount, Length: 170, dtype: float64

In [41]:
df.query('trip_time > "1 hour"')['total_amount'].mean()

62.57652941176472

In [42]:
df.query('trip_time > "1 hour"')['total_amount'].describe()

count    170.000000
mean      62.576529
std       15.843810
min        3.300000
25%       58.340000
50%       58.615000
75%       69.980000
max      160.050000
Name: total_amount, dtype: float64

In [45]:
df.query('trip_time < "10 minutes"')['passenger_count'].mean()

1.6375731772219266

In [46]:
df.query('trip_time > "1 hour"')['passenger_count'].mean()

1.6941176470588235

In [47]:
df.head(20)

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,0 days 00:28:23
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17
5,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,10.55,0 days 00:09:15
6,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,16.30,0 days 00:19:12
7,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84,0 days 01:17:11
8,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,15.80,0 days 00:25:43
9,2015-06-02 11:19:38,2015-06-02 11:23:50,1,0.60,6.30,0 days 00:04:12
10,2015-06-02 11:19:38,2015-06-02 11:19:43,3,0.01,52.80,0 days 00:00:05
11,2015-06-02 11:19:39,2015-06-02 11:36:43,1,1.65,14.80,0 days 00:17:04
12,2015-06-02 11:19:40,2015-06-02 11:34:34,1,1.14,11.30,0 days 00:14:54
13,2015-06-02 11:19:41,2015-06-02 11:23:56,2,0.50,6.60,0 days 00:04:15
14,2015-06-02 11:19:41,2015-06-02 11:29:59,1,1.28,8.80,0 days 00:10:18
15,2015-06-02 11:19:42,2015-06-02 11:22:33,2,0.60,4.80,0 days 00:02:51
16,2015-06-02 11:19:44,2015-06-02 11:38:10,1,1.41,15.36,0 days 00:18:26
17,2015-06-02 11:19:44,2015-06-02 11:30:31,1,0.70,8.80,0 days 00:10:47
18,2015-06-02 11:19:45,2015-06-02 11:42:03,1,1.90,19.12,0 days 00:22:18
19,2015-06-02 11:19:47,2015-06-02 11:26:48,1,1.10,7.30,0 days 00:07:01

In [49]:
df[df['tpep_pickup_datetime'] == '2015-06-02 11:19:32']

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17
231,2015-06-02 11:19:32,2015-06-02 11:41:50,1,1.68,18.36,0 days 00:22:18
232,2015-06-02 11:19:32,2015-06-02 11:36:04,6,4.20,17.30,0 days 00:16:32
459,2015-06-02 11:19:32,2015-06-02 11:27:28,1,1.10,7.80,0 days 00:07:56
460,2015-06-02 11:19:32,2015-06-02 11:38:08,3,2.10,16.55,0 days 00:18:36
1068,2015-06-02 11:19:32,2015-06-02 11:30:07,1,1.00,8.80,0 days 00:10:35

In [50]:
# use a datetime column as the index into the data frame!

df = df.set_index('tpep_pickup_datetime')
df.head()

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
tpep_pickup_datetime,,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,0 days 00:28:23
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17

In [52]:
# (1) with a datetime index, I can retrieve rows by datetime

df.loc['2015-06-02 11:19:32']

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
tpep_pickup_datetime,,,,,
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17
2015-06-02 11:19:32,2015-06-02 11:41:50,1,1.68,18.36,0 days 00:22:18
2015-06-02 11:19:32,2015-06-02 11:36:04,6,4.20,17.30,0 days 00:16:32
2015-06-02 11:19:32,2015-06-02 11:27:28,1,1.10,7.80,0 days 00:07:56
2015-06-02 11:19:32,2015-06-02 11:38:08,3,2.10,16.55,0 days 00:18:36
2015-06-02 11:19:32,2015-06-02 11:30:07,1,1.00,8.80,0 days 00:10:35

In [53]:
# (2) with a datetime index, I can retrieve fuzzy dates

df.loc['2015-06-02 11:19']  # no seconds == wildcard seconds

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
tpep_pickup_datetime,,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,0 days 00:28:23
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17
...,...,...,...,...,...
2015-06-02 11:19:56,2015-06-02 11:24:18,1,0.60,7.80,0 days 00:04:22
2015-06-02 11:19:57,2015-06-02 11:26:37,1,0.90,8.16,0 days 00:06:40
2015-06-02 11:19:58,2015-06-02 11:27:59,1,0.90,9.80,0 days 00:08:01
2015-06-02 11:19:59,2015-06-02 11:39:51,1,2.01,16.80,0 days 00:19:52
2015-06-02 11:19:59,2015-06-02 11:37:33,5,1.74,16.00,0 days 00:17:34

In [54]:
df.loc['2015-06-02 11']  # no minutes == wildcard seconds + minutes

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
tpep_pickup_datetime,,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,0 days 00:28:23
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17
...,...,...,...,...,...
2015-06-02 11:33:35,2015-06-02 11:42:16,1,0.73,7.80,0 days 00:08:41
2015-06-02 11:33:35,2015-06-02 11:38:53,1,0.96,8.50,0 days 00:05:18
2015-06-02 11:33:36,2015-06-02 11:52:32,2,3.50,18.80,0 days 00:18:56
2015-06-02 11:33:35,2015-06-02 11:55:02,5,2.14,14.80,0 days 00:21:27
2015-06-02 11:33:30,2015-06-02 11:42:45,5,0.61,7.80,0 days 00:09:15

In [56]:
# (3) Use slice to retrieve several rows from the data frame, by timestamp

df.loc['2015-06-02 11:19:30':'2015-06-02 11:20:15']

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
tpep_pickup_datetime,,,,,
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17
2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,10.55,0 days 00:09:15
...,...,...,...,...,...
2015-06-02 11:20:12,2015-06-02 11:27:39,2,1.07,7.80,0 days 00:07:27
2015-06-02 11:20:12,2015-06-02 11:27:53,2,0.86,8.76,0 days 00:07:41
2015-06-02 11:20:14,2015-06-02 11:49:25,1,2.30,18.30,0 days 00:29:11
2015-06-02 11:20:14,2015-06-02 11:44:26,5,2.31,16.30,0 days 00:24:12
2015-06-02 11:20:15,2015-06-02 11:41:44,2,1.51,14.30,0 days 00:21:29

# Exercises: Datetime indexes

1. Set the index to be `tpep_pickup_datetime`.
2. Get all of the records which took place between 2015-06-02 11:45 and 11:47. How many rides were there, and how much did they pay, on average?
3. Find the average trip distance where the date is `2015-06-02`.

In [66]:
df = pd.read_csv('taxi.csv',
                usecols=['tpep_pickup_datetime',
                        'tpep_dropoff_datetime',
                        'passenger_count',
                        'trip_distance',
                        'total_amount'],
                parse_dates=['tpep_pickup_datetime',
                            'tpep_dropoff_datetime'] ,
                index_col='tpep_pickup_datetime')

df.head()

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 9999 entries, 2015-06-02 11:19:29 to 2015-06-01 00:13:04
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   tpep_dropoff_datetime  9999 non-null   datetime64[ns]
 1   passenger_count        9999 non-null   int64
 2   trip_distance          9999 non-null   float64
 3   total_amount           9999 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 390.6 KB

In [73]:
df.loc['2015-06-02 11:25':'2015-06-02 11:27']

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:25:00,2015-06-02 11:32:39,1,1.00,7.80
2015-06-02 11:25:01,2015-06-02 11:26:49,1,0.60,4.80
2015-06-02 11:25:01,2015-06-02 11:29:56,5,0.43,6.80
2015-06-02 11:25:03,2015-06-02 11:44:57,1,3.00,19.75
2015-06-02 11:25:03,2015-06-02 11:50:38,1,5.80,28.56
...,...,...,...,...
2015-06-02 11:27:57,2015-06-02 11:30:41,1,0.60,10.30
2015-06-02 11:27:58,2015-06-02 11:37:44,1,2.27,11.30
2015-06-02 11:27:59,2015-06-02 12:23:22,1,11.40,59.79
2015-06-02 11:27:59,2015-06-02 11:55:14,1,1.50,20.15
2015-06-02 11:27:57,2015-06-02 12:01:05,1,3.39,25.56

In [74]:
df.loc['2015-06-02 11:25':'2015-06-02 11:27'].shape

(953, 4)

In [76]:
df.loc['2015-06-02 11:25':'2015-06-02 11:27']['total_amount'].mean()

16.93557187827912

In [78]:
df.loc['2015-06-02']['trip_distance'].mean()

2.6611988171064604

In [79]:
df.head(20)

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30
2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,10.55
2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,16.30
2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84
2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,15.80
2015-06-02 11:19:38,2015-06-02 11:23:50,1,0.60,6.30
2015-06-02 11:19:38,2015-06-02 11:19:43,3,0.01,52.80
2015-06-02 11:19:39,2015-06-02 11:36:43,1,1.65,14.80
2015-06-02 11:19:40,2015-06-02 11:34:34,1,1.14,11.30
2015-06-02 11:19:41,2015-06-02 11:23:56,2,0.50,6.60
2015-06-02 11:19:41,2015-06-02 11:29:59,1,1.28,8.80
2015-06-02 11:19:42,2015-06-02 11:22:33,2,0.60,4.80
2015-06-02 11:19:44,2015-06-02 11:38:10,1,1.41,15.36
2015-06-02 11:19:44,2015-06-02 11:30:31,1,0.70,8.80
2015-06-02 11:19:45,2015-06-02 11:42:03,1,1.90,19.12
2015-06-02 11:19:47,2015-06-02 11:26:48,1,1.10,7.30

In [80]:
df.resample('1H')

In [81]:
df.resample('1H')['trip_distance'].mean()

tpep_pickup_datetime
2015-06-01 00:00:00    4.312809
2015-06-01 01:00:00         NaN
2015-06-01 02:00:00         NaN
2015-06-01 03:00:00         NaN
2015-06-01 04:00:00         NaN
                         ...
2015-06-06 12:00:00         NaN
2015-06-06 13:00:00         NaN
2015-06-06 14:00:00         NaN
2015-06-06 15:00:00         NaN
2015-06-06 16:00:00    2.852166
Freq: H, Name: trip_distance, Length: 137, dtype: float64

In [82]:
df.resample('1H')['trip_distance'].mean().dropna()

tpep_pickup_datetime
2015-06-01 00:00:00    4.312809
2015-06-02 11:00:00    2.661199
2015-06-04 15:00:00    2.986285
2015-06-06 16:00:00    2.852166
Name: trip_distance, dtype: float64

In [83]:
asdfafa asdf afa asdfaf a fa fasf a as fsadf a 
asdfafa asdfafa asdfaf

SyntaxError: invalid syntax (<ipython-input-83-f68175757d88>, line 1)